In [1]:
import numpy as np
import pandas as pd

In [5]:
tab1 = pd.read_csv('C:\\Users\\enama\\Downloads\\ass-2\\Table1.csv')

In [6]:
tab2 = pd.read_csv('C:\\Users\\enama\\Downloads\\ass-2\\Table2.csv')

In [7]:
tab1.head()

   CustomerNum
0           17
1           20
2            5
3           28
4           15

In [8]:
tab2.head()

   CustomerNum
0           84
1           85
2           72
3          100
4           65

In [31]:
a = tab1['CustomerNum'].sort_values(ascending = True)

In [32]:
a = pd.DataFrame(a)

In [33]:
a.head()

    CustomerNum
24            1
10            2
13            3
28            4
2             5

In [34]:
b = tab2['CustomerNum'].sort_values(ascending = True)

In [35]:
b = pd.DataFrame(b)

In [36]:
b.head()

    CustomerNum
9            51
47           52
20           53
36           54
46           55

In [37]:
a.reset_index(inplace=True)

In [46]:
a.drop('index', axis=1,inplace=True)

In [42]:
b.reset_index(inplace = True)

In [47]:
b.drop('index',axis=1,inplace=True)

In [48]:
a.head()

   CustomerNum
0            1
1            2
2            3
3            4
4            5

In [49]:
b.head()

   CustomerNum
0           51
1           52
2           53
3           54
4           55

In [58]:
c= a[0:3]

In [59]:
d= b[0:4]

In [60]:
pd.concat([c,d], sort=False, axis=0)

   CustomerNum
0            1
1            2
2            3
0           51
1           52
2           53
3           54